In [1]:
import pandas as pd

## Review Merge
First let's look at today's power point slides (5 Merge-Groupby-EnergyAndDevelopment.pptx).

ppt slides show an overview of how merging works.

## Merging
Lets make another data frame and tack it on to the first

In [2]:
fruit_info={'fruit':['apple','banana','orange','raspberry'],
                  'color':['red','yellow','orange','pink'],
                  'weight':[120,150,250,15]
         }
fruit_info_df = pd.DataFrame(data = fruit_info)
fruit_info_df

    color      fruit  weight
0     red      apple     120
1  yellow     banana     150
2  orange     orange     250
3    pink  raspberry      15

In [3]:
price_df = pd.DataFrame({'price':[0.65, 1, 0.15, 0.5],
                        'fruit':['banana', 'orange', 'raspberry','apple']})
price_df

       fruit  price
0     banana   0.65
1     orange   1.00
2  raspberry   0.15
3      apple   0.50

In [4]:
merged_df = pd.merge(price_df,fruit_info_df, left_on='fruit', right_on='fruit')
merged_df

       fruit  price   color  weight
0     banana   0.65  yellow     150
1     orange   1.00  orange     250
2  raspberry   0.15    pink      15
3      apple   0.50     red     120

Note, the order was different for each row, but Pandas figured it out.

Note, there are other commands -- `join`, `concat`, and these do similar things.  

I haven't learned enough to carefully choose between them, but merge seems to work well, and `join` seems to be less functional. 

FWIW, `pd.concat` seems to be a little more brute force -- requires more careful syntax, but likely does unexpected things less often once you understand the syntax.

We can streamline by replacing the index number with the fruit column.  

What's the `inplace` command for?  It means the re-defined dataframe is assigned to the original name.  This is advantageous in memory constrained situations.

In [5]:
merged_df.set_index('fruit', inplace = True)
merged_df

           price   color  weight
fruit
banana      0.65  yellow     150
orange      1.00  orange     250
raspberry   0.15    pink      15
apple       0.50     red     120

Here's a cool little factoid about data frames: you can write for loops that burn through the columns of the frame.

In [6]:
for i in merged_df:
    print(merged_df.loc['raspberry',i])

0.15
pink
15

## Groupby
(these notes adapted from last Spring's DS100 notebook)

First, let's have another look at today's power point file.  Now we'll learn about how groupby works.

Back to the notebook, let's make a toy DF (example taken from Wes McKinney's [Python for Data Analysis](http://proquest.safaribooksonline.com.libproxy.berkeley.edu/book/programming/python/9781491957653):

In [7]:
import numpy as np

In [8]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

      data1     data2 key1 key2
0  0.462675  1.016677    a  one
1 -0.070713 -0.140984    a  two
2 -0.182932 -0.080727    b  one
3  1.132310 -0.925350    b  two
4  2.513169 -2.082701    a  one

Let's group just the `data1` column by the `key1` column. A call to [`groupby`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html) does that.  

Note, the syntax is to begin by invoking the portion of the dataframe we want to group (here, `df['data1']`), then we apply the groupby method with the portion of hte dataframe we want to group on (here `df['key1']`)

What is the object that results?

In [9]:
grouped = df['data1'].groupby(df['key1'])
grouped

As we see, it's not simply a new DataFrame. Instead, it's an object, in this case `SeriesGroupBy`.  We'll see in a moment that if we group many columns of data we get a `DataFrameGroupBy` object.

To look inside we need to use different syntax.  The specific thing we're looking for are the groups of the object...but let's tab in to the grouped object to see what's there.

In [10]:
grouped.groups

{'a': Int64Index([0, 1, 4], dtype='int64'),
 'b': Int64Index([2, 3], dtype='int64')}

That gave us the groups (a and b) and the indices of elements in the groups, but nothing else. 

If we call `grouped.groups` elements, we don't get much of use; we wind up just retrieving the elements of the list above:

In [11]:
grouped.groups['a'][2]

4

But the `grouped` object is capable of making computations across all groups -- this is where it gets powerful.   

We can try things like `.count()`, `.min()` and `.mean()`.  

Notice if you don't put the parens after the method, pandas returns information about what the method does, but not it's actual output.

In [12]:
grouped.aggregate(min)

key1
a   -0.070713
b   -0.182932
Name: data1, dtype: float64

There are a number of functions you can pass in to ``aggregate``, like `sum` and `max`.

But it can be informative to look at what's inside. We can iterate over a `groupby` object, as we iterate we get pairs of `(name, group)`, where the `group` is either a `Series` or a `DataFrame`, depending on whether the `groupby` object is a `SeriesGroupBy` (as above) or a `DataFrameGroupBy` (see below):

In [13]:
from IPython.display import display  # like print, but for complex objects

for name, group in grouped:
    print('Name:', name)
    display(group)

Name: a

0    0.462675
1   -0.070713
4    2.513169
Name: data1, dtype: float64

Name: b

2   -0.182932
3    1.132310
Name: data1, dtype: float64

We can group on multiple keys, and the result is grouping by tuples:

In [14]:
g2 = df['data1'].groupby([df['key1'], df['key2']])
g2

In [15]:
g2.groups

{('a', 'one'): Int64Index([0, 4], dtype='int64'),
 ('a', 'two'): Int64Index([1], dtype='int64'),
 ('b', 'one'): Int64Index([2], dtype='int64'),
 ('b', 'two'): Int64Index([3], dtype='int64')}

Let's look at the dataframe again, for a reminder:

In [16]:
df

      data1     data2 key1 key2
0  0.462675  1.016677    a  one
1 -0.070713 -0.140984    a  two
2 -0.182932 -0.080727    b  one
3  1.132310 -0.925350    b  two
4  2.513169 -2.082701    a  one

In [17]:
g2.mean()

key1  key2
a     one     1.487922
      two    -0.070713
b     one    -0.182932
      two     1.132310
Name: data1, dtype: float64

We can also group the entire dataframe -- not just one column of it -- on a single key. This results in a `DataFrameGroupBy` object as the result:

In [18]:
k1g = df.groupby('key1')
k1g

In [19]:
k1g.groups

{'a': Int64Index([0, 1, 4], dtype='int64'),
 'b': Int64Index([2, 3], dtype='int64')}

In [20]:
k1g.mean()

         data1     data2
key1
a     0.968377 -0.402336
b     0.474689 -0.503038

But let's look at what's inside of k1g:

In [21]:
for n, g in k1g:
    print('name:', n)
    display(g)

name: a

      data1     data2 key1 key2
0  0.462675  1.016677    a  one
1 -0.070713 -0.140984    a  two
4  2.513169 -2.082701    a  one

name: b

      data1     data2 key1 key2
2 -0.182932 -0.080727    b  one
3  1.132310 -0.925350    b  two

Where did column `key2` go in the mean above? It's a *nuisance column*, which gets automatically eliminated from an operation where it doesn't make sense (such as a numerical mean).

### Grouping over a different dimension

Above, we've been grouping data along the rows, using column keys as our selectors.  

But we can also group along the *columns*, 

What's even more cool?  We can group by *data type*.

Here we'll group along columns, by data type:

In [22]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [23]:
grouped = df.groupby(df.dtypes, axis=1)
for dtype, group in grouped:
    print(dtype)
    display(group)

float64

      data1     data2
0  0.462675  1.016677
1 -0.070713 -0.140984
2 -0.182932 -0.080727
3  1.132310 -0.925350
4  2.513169 -2.082701

object

  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

## Let's take the quiz.

## Using groupby to re-ask our question
Which hour had the lowest average wind production?

In [24]:
cds = pd.read_csv('CAISO_2017to2018_stack.csv', index_col= 0)

In [25]:
cds.head()

                          Source   MWh
2017-08-29 00:00:00   GEOTHERMAL  1181
2017-08-29 00:00:00      BIOMASS   340
2017-08-29 00:00:00       BIOGAS   156
2017-08-29 00:00:00  SMALL HYDRO   324
2017-08-29 00:00:00   WIND TOTAL  1551

It will help to have a column of hour of day values:

In [30]:
cds_time = pd.to_datetime(cds.index)
cds_time.hour
type(cds_time)

pandas.core.indexes.datetimes.DatetimeIndex

Let's add that list of values into the data frame.

In [ ]:
cds['hour'] = cds_time.hour

In [ ]:
cds.head(10)

Now do the grouping.

See if you can do it yourself: we want to group MWh values by source AND hour.

In [ ]:
cds_grouped = cds['MWh'].groupby([cds['Source'],cds['hour']])

In [ ]:
cds_grouped.groups

Now we can see *all* the means for all sources and hours.

Didn't need to do any fancy logical indexing or looping!

In [ ]:
cds_grouped.mean()

Now it would be nice to see that information in a dataframe, wouldn't it?

In [ ]:
averages = pd.DataFrame(cds_grouped.mean())

In [ ]:
averages

And lo and behold, we have a multilevel index for the rows!

In [ ]:
averages.loc[('WIND TOTAL',),:]

But now we can look at other sources

In [ ]:
averages.index

In [ ]:
averages.loc[('SMALL HYDRO',),:]

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
plt.plot(averages.loc[('SMALL HYDRO',),:])

In [ ]:
plt.plot(averages.loc[('GEOTHERMAL',),:])

In [ ]:
plt.plot(averages.loc[('SOLAR PV',),:])

In [ ]:
plt.plot(cds.loc[cds.loc[:,'Source']=='SOLAR PV','MWh'])

## Pivot

Pivot is used to examine aggregates with respect to two characteristics.  You might construct a pivot of sales data if you wanted to look at average sales broken down by year and market.

The pivot operation is essentially a `groupby` operation that transforms the rows *and the columns.*   For example consider the following **groupby** operation:

In [ ]:
cds_grouped.groups

We can use `pivot` to do similar things:

In [ ]:
cds.pivot_table(
    values  = 'MWh', # the entry to aggregate over
    index   = 'hour',  # the row grouping attributes
    columns = 'Source',    # the column grouping attributes
    aggfunc = 'mean'   # the aggregation function
)

In class test: create a pivot table where the columns are the hours, source is the column and the returned value is the standard deviation.

Hint: write `std` to represent standard deviation.

In [ ]:
cds.pivot_table(
    values  = 'MWh',
    index   = 'Source',
    columns = 'hour',
    aggfunc = 'std'
)